# Groupby Guide to Grouping Data in pandas

In [2]:
import pandas as pd 
var = pd.DataFrame({"name":["a","b","c","d","a","b","a","b","a","c","c","d"],
                    "s_1":[12,13,14,12,13,14,23,15,25,16,10,34],
                    "s_2":[23,24,25,26,27,28,29,30,25,34,35,56]})
var

   name  s_1  s_2
0     a   12   23
1     b   13   24
2     c   14   25
3     d   12   26
4     a   13   27
5     b   14   28
6     a   23   29
7     b   15   30
8     a   25   25
9     c   16   34
10    c   10   35
11    d   34   56

In [3]:
var_new =var.groupby("name")
var_new

In [4]:
for x,y in var_new:
    print(x)
    print(y)

a
  name  s_1  s_2
0    a   12   23
4    a   13   27
6    a   23   29
8    a   25   25
b
  name  s_1  s_2
1    b   13   24
5    b   14   28
7    b   15   30
c
   name  s_1  s_2
2     c   14   25
9     c   16   34
10    c   10   35
d
   name  s_1  s_2
3     d   12   26
11    d   34   56

In [6]:
var_new.get_group("d")

   name  s_1  s_2
3     d   12   26
11    d   34   56

In [9]:
var_new.min()

      s_1  s_2
name
a      12   23
b      13   24
c      10   25
d      12   26

In [10]:
var_new.max()

      s_1  s_2
name
a      25   29
b      15   30
c      16   35
d      34   56

In [11]:
var_new.mean()

            s_1        s_2
name
a     18.250000  26.000000
b     14.000000  27.333333
c     13.333333  31.333333
d     23.000000  41.000000

In [15]:
li = list(var_new)
li

[('a',
    name  s_1  s_2
  0    a   12   23
  4    a   13   27
  6    a   23   29
  8    a   25   25),
 ('b',
    name  s_1  s_2
  1    b   13   24
  5    b   14   28
  7    b   15   30),
 ('c',
     name  s_1  s_2
  2     c   14   25
  9     c   16   34
  10    c   10   35),
 ('d',
     name  s_1  s_2
  3     d   12   26
  11    d   34   56)]